original/app/controllers/flings_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `payloads`
---
  def new
    @fling = Fling.new
    if params[:target_id]
      @target = User.find_by_id(params[:target_id])
      if @target
        @fling.target_email = @target.email
        @fling.target_name = @target.name
      end
    end

    @fling.payload = @payloads.first

INSERT INTO `flings` (`message`, `updated_at`, `target_email`, `target_name`, `payload_id`, `flinger_id`, `created_at`) VALUES('eat this!', '2010-06-02 17:01:38', 'k@kdi99.com', 'ked', 7, 1, '2010-06-02 17:01:38')
---
  def create
    @fling = current_user.flings.build(params[:fling])
    if @fling.save

SELECT * FROM `flings` WHERE (`flings`.`id` = '1') LIMIT 1
---
  def show
    @fling = Fling.find(params[:id])

SELECT * FROM `payloads`
---
  def load_payloads
    @payloads = Payload.all